zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpi2c_reg.h
     * |        |          |Software can write 1 to clear this bit.
     * |[1]     |RXWKF     |RX Transfer Count Match Wakeup Flag
     * |        |          |When chip is woken up from Power-down mode by LPI2C RX transfer count match, this bit is set to 1
     * |        |          |Software can write 1 to clear this bit.
     * |[2]     |ERRORWKF  |Error Condition Wakeup Flag
     * |        |          |When chip is woken up from Power-down mode by LPI2C receiving NACK from slave, running into bus error or arbitration lost, this bit is set to 1
     * |        |          |Software can write 1 to clear this bit.
     * |[8]     |TXFINISH  |Automatic Operation TX Finish Flag
     * |        |          |AOFINISH is set when finishing one round of auto operation(Automode = 1), but it will not issue interrupt
     * |        |          |Software can write 1 to clear this bit.
     * |[9]     |RXFINISH  |Automatic Operation RX Finish Flag
     * |        |          |RXFINISH is set when finishing one round of auto operation(Automode = 2/3/4), but it will not issue interrupt
     * |        |          |Software can write 1 to clear this bit.
     * |[10]    |ERRORIF   |ERROR Interrupt Flag
     * |        |          |When LPI2C receiving NACK from slave, running into bus error or arbitration lost, this bit is set to 1
     * |        |          |Software can write 1 to clear this bit.
     * |[24]    |AOFINISH  |Automatic Operation Finish Flag
     * |        |          |AOFINISH is set when finishing one round of auto operation, but it will not issue interrupt
     * |        |          |Software can write 1 to clear this bit.
     * |[31]    |BUSY      |Busy Flag
     * |        |          |When chip is woken up and this bit is set to 1, it means that there are one or more requests from trigger source during transfer
     * |        |          |Software can write 1 to clear this bit.
     * @var LPI2C_T::AUTOCNT
     * Offset: 0x78  LPI2C Automatic Operation Transfer Count Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |TXCNT     |TX Transfer Count
     * |        |          |Bit [7:0] is set for TXPDMA and Random Read transfer mode
     * |        |          |TXCNT represents the required number of the transfer, the real transfer count is TXCNT + 1
     * |        |          |The maximum transfer count is 255 + 1.
     * |[23:16] |RXCNT     |RX Transfer Count
     * |        |          |Bit [23:16] is set for RXPDMA and Random Read transfer mode
     * |        |          |RXCNT represents the required number of the transfer, the real transfer count is RXCNT + 1
     * |        |          |The maximum transfer count is 255 + 1.
     */
    __IO uint32_t CTL0;                  /*!< [0x0000] LPI2C Control Register 0                                         */
    __IO uint32_t ADDR0;                 /*!< [0x0004] LPI2C Slave Address Register0                                    */
    __IO uint32_t DAT;                   /*!< [0x0008] LPI2C Data Register                                              */
    __I  uint32_t STATUS0;               /*!< [0x000c] LPI2C Status Register 0                                          */
    __IO uint32_t CLKDIV;                /*!< [0x0010] LPI2C Clock Divided Register                                     */
    __IO uint32_t TOCTL;                 /*!< [0x0014] LPI2C Time-out Control Register                                  */
    __IO uint32_t ADDR1;                 /*!< [0x0018] LPI2C Slave Address Register1                                    */
    __IO uint32_t ADDR2;                 /*!< [0x001c] LPI2C Slave Address Register2                                    */
    __IO uint32_t ADDR3;                 /*!< [0x0020] LPI2C Slave Address Register3                                    */
    __IO uint32_t ADDRMSK0;              /*!< [0x0024] LPI2C Slave Address Mask Register0                               */
    __IO uint32_t ADDRMSK1;              /*!< [0x0028] LPI2C Slave Address Mask Register1                               */
    __IO uint32_t ADDRMSK2;              /*!< [0x002c] LPI2C Slave Address Mask Register2                               */
    __IO uint32_t ADDRMSK3;              /*!< [0x0030] LPI2C Slave Address Mask Register3                               */
    __I  uint32_t RESERVE0[2];
    __IO uint32_t WKCTL;                 /*!< [0x003c] LPI2C Wake-up Control Register                                   */
    __IO uint32_t WKSTS;                 /*!< [0x0040] LPI2C Wake-up Status Register                                    */
    __IO uint32_t CTL1;                  /*!< [0x0044] LPI2C Control Register 1                                         */
    __IO uint32_t STATUS1;               /*!< [0x0048] LPI2C Status Register 1                                          */
    __IO uint32_t TMCTL;                 /*!< [0x004c] LPI2C Timing Configure Control Register                          */
    __I  uint32_t RESERVE1[8];
    __IO uint32_t AUTOCTL;               /*!< [0x0070] LPI2C Automatic Operation Control Register                       */
    __IO uint32_t AUTOSTS;               /*!< [0x0074] LPI2C Automatic Operation Status Register                        */
    __IO uint32_t AUTOCNT;               /*!< [0x0078] LPI2C Automatic Operation Transfer Count Register                */

} LPI2C_T;

/**
    @addtogroup LPI2C_CONST LPI2C Bit Field Definition
    Constant Definitions for LPI2C Controller
@{ */

#define LPI2C_CTL0_AA_Pos                (2)                                               /*!< LPI2C_T::CTL0: AA Position             */
#define LPI2C_CTL0_AA_Msk                (0x1ul << LPI2C_CTL0_AA_Pos)                      /*!< LPI2C_T::CTL0: AA Mask                 */

#define LPI2C_CTL0_SI_Pos                (3)                                               /*!< LPI2C_T::CTL0: SI Position             */
#define LPI2C_CTL0_SI_Msk                (0x1ul << LPI2C_CTL0_SI_Pos)                      /*!< LPI2C_T::CTL0: SI Mask                 */

#define LPI2C_CTL0_STO_Pos               (4)                                               /*!< LPI2C_T::CTL0: STO Position            */
#define LPI2C_CTL0_STO_Msk               (0x1ul << LPI2C_CTL0_STO_Pos)                     /*!< LPI2C_T::CTL0: STO Mask                */

#define LPI2C_CTL0_STA_Pos               (5)                                               /*!< LPI2C_T::CTL0: STA Position            */
#define LPI2C_CTL0_STA_Msk               (0x1ul << LPI2C_CTL0_STA_Pos)                     /*!< LPI2C_T::CTL0: STA Mask                */

#define LPI2C_CTL0_LPI2CEN_Pos           (6)                                               /*!< LPI2C_T::CTL0: LPI2CEN Position        */
#define LPI2C_CTL0_LPI2CEN_Msk           (0x1ul << LPI2C_CTL0_LPI2CEN_Pos)                 /*!< LPI2C_T::CTL0: LPI2CEN Mask            */

#define LPI2C_CTL0_INTEN_Pos             (7)                                               /*!< LPI2C_T::CTL0: INTEN Position          */
#define LPI2C_CTL0_INTEN_Msk             (0x1ul << LPI2C_CTL0_INTEN_Pos)                   /*!< LPI2C_T::CTL0: INTEN Mask              */

