zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpi2c_reg.h
#define LPI2C_ADDR0_GC_Pos               (0)                                               /*!< LPI2C_T::ADDR0: GC Position            */
#define LPI2C_ADDR0_GC_Msk               (0x1ul << LPI2C_ADDR0_GC_Pos)                     /*!< LPI2C_T::ADDR0: GC Mask                */

#define LPI2C_ADDR0_ADDR_Pos             (1)                                               /*!< LPI2C_T::ADDR0: ADDR Position          */
#define LPI2C_ADDR0_ADDR_Msk             (0x7ful << LPI2C_ADDR0_ADDR_Pos)                  /*!< LPI2C_T::ADDR0: ADDR Mask              */

#define LPI2C_DAT_DAT_Pos                (0)                                               /*!< LPI2C_T::DAT: DAT Position             */
#define LPI2C_DAT_DAT_Msk                (0xfful << LPI2C_DAT_DAT_Pos)                     /*!< LPI2C_T::DAT: DAT Mask                 */

#define LPI2C_STATUS0_STATUS_Pos         (0)                                               /*!< LPI2C_T::STATUS0: STATUS Position      */
#define LPI2C_STATUS0_STATUS_Msk         (0xfful << LPI2C_STATUS0_STATUS_Pos)              /*!< LPI2C_T::STATUS0: STATUS Mask          */

#define LPI2C_CLKDIV_DIVIDER_Pos         (0)                                               /*!< LPI2C_T::CLKDIV: DIVIDER Position      */
#define LPI2C_CLKDIV_DIVIDER_Msk         (0x3fful << LPI2C_CLKDIV_DIVIDER_Pos)             /*!< LPI2C_T::CLKDIV: DIVIDER Mask          */

#define LPI2C_CLKDIV_NFCNT_Pos           (12)                                              /*!< LPI2C_T::CLKDIV: NFCNT Position        */
#define LPI2C_CLKDIV_NFCNT_Msk           (0xful << LPI2C_CLKDIV_NFCNT_Pos)                 /*!< LPI2C_T::CLKDIV: NFCNT Mask            */

#define LPI2C_TOCTL_TOIF_Pos             (0)                                               /*!< LPI2C_T::TOCTL: TOIF Position          */
#define LPI2C_TOCTL_TOIF_Msk             (0x1ul << LPI2C_TOCTL_TOIF_Pos)                   /*!< LPI2C_T::TOCTL: TOIF Mask              */

#define LPI2C_TOCTL_TOCDIV4_Pos          (1)                                               /*!< LPI2C_T::TOCTL: TOCDIV4 Position       */
#define LPI2C_TOCTL_TOCDIV4_Msk          (0x1ul << LPI2C_TOCTL_TOCDIV4_Pos)                /*!< LPI2C_T::TOCTL: TOCDIV4 Mask           */

#define LPI2C_TOCTL_TOCEN_Pos            (2)                                               /*!< LPI2C_T::TOCTL: TOCEN Position         */
#define LPI2C_TOCTL_TOCEN_Msk            (0x1ul << LPI2C_TOCTL_TOCEN_Pos)                  /*!< LPI2C_T::TOCTL: TOCEN Mask             */

#define LPI2C_ADDR1_GC_Pos               (0)                                               /*!< LPI2C_T::ADDR1: GC Position            */
#define LPI2C_ADDR1_GC_Msk               (0x1ul << LPI2C_ADDR1_GC_Pos)                     /*!< LPI2C_T::ADDR1: GC Mask                */

#define LPI2C_ADDR1_ADDR_Pos             (1)                                               /*!< LPI2C_T::ADDR1: ADDR Position          */
#define LPI2C_ADDR1_ADDR_Msk             (0x7ful << LPI2C_ADDR1_ADDR_Pos)                  /*!< LPI2C_T::ADDR1: ADDR Mask              */

#define LPI2C_ADDR2_GC_Pos               (0)                                               /*!< LPI2C_T::ADDR2: GC Position            */
#define LPI2C_ADDR2_GC_Msk               (0x1ul << LPI2C_ADDR2_GC_Pos)                     /*!< LPI2C_T::ADDR2: GC Mask                */

#define LPI2C_ADDR2_ADDR_Pos             (1)                                               /*!< LPI2C_T::ADDR2: ADDR Position          */
#define LPI2C_ADDR2_ADDR_Msk             (0x7ful << LPI2C_ADDR2_ADDR_Pos)                  /*!< LPI2C_T::ADDR2: ADDR Mask              */

#define LPI2C_ADDR3_GC_Pos               (0)                                               /*!< LPI2C_T::ADDR3: GC Position            */
#define LPI2C_ADDR3_GC_Msk               (0x1ul << LPI2C_ADDR3_GC_Pos)                     /*!< LPI2C_T::ADDR3: GC Mask                */

#define LPI2C_ADDR3_ADDR_Pos             (1)                                               /*!< LPI2C_T::ADDR3: ADDR Position          */
#define LPI2C_ADDR3_ADDR_Msk             (0x7ful << LPI2C_ADDR3_ADDR_Pos)                  /*!< LPI2C_T::ADDR3: ADDR Mask              */

#define LPI2C_ADDRMSK0_ADDRMSK_Pos       (1)                                               /*!< LPI2C_T::ADDRMSK0: ADDRMSK Position    */
#define LPI2C_ADDRMSK0_ADDRMSK_Msk       (0x7ful << LPI2C_ADDRMSK0_ADDRMSK_Pos)            /*!< LPI2C_T::ADDRMSK0: ADDRMSK Mask        */

#define LPI2C_ADDRMSK1_ADDRMSK_Pos       (1)                                               /*!< LPI2C_T::ADDRMSK1: ADDRMSK Position    */
#define LPI2C_ADDRMSK1_ADDRMSK_Msk       (0x7ful << LPI2C_ADDRMSK1_ADDRMSK_Pos)            /*!< LPI2C_T::ADDRMSK1: ADDRMSK Mask        */

#define LPI2C_ADDRMSK2_ADDRMSK_Pos       (1)                                               /*!< LPI2C_T::ADDRMSK2: ADDRMSK Position    */
#define LPI2C_ADDRMSK2_ADDRMSK_Msk       (0x7ful << LPI2C_ADDRMSK2_ADDRMSK_Pos)            /*!< LPI2C_T::ADDRMSK2: ADDRMSK Mask        */

#define LPI2C_ADDRMSK3_ADDRMSK_Pos       (1)                                               /*!< LPI2C_T::ADDRMSK3: ADDRMSK Position    */
#define LPI2C_ADDRMSK3_ADDRMSK_Msk       (0x7ful << LPI2C_ADDRMSK3_ADDRMSK_Pos)            /*!< LPI2C_T::ADDRMSK3: ADDRMSK Mask        */

#define LPI2C_WKCTL_WKEN_Pos             (0)                                               /*!< LPI2C_T::WKCTL: WKEN Position          */
#define LPI2C_WKCTL_WKEN_Msk             (0x1ul << LPI2C_WKCTL_WKEN_Pos)                   /*!< LPI2C_T::WKCTL: WKEN Mask              */

#define LPI2C_WKCTL_NHDBUSEN_Pos         (7)                                               /*!< LPI2C_T::WKCTL: NHDBUSEN Position      */
#define LPI2C_WKCTL_NHDBUSEN_Msk         (0x1ul << LPI2C_WKCTL_NHDBUSEN_Pos)               /*!< LPI2C_T::WKCTL: NHDBUSEN Mask          */

#define LPI2C_WKSTS_WKIF_Pos             (0)                                               /*!< LPI2C_T::WKSTS: WKIF Position          */
#define LPI2C_WKSTS_WKIF_Msk             (0x1ul << LPI2C_WKSTS_WKIF_Pos)                   /*!< LPI2C_T::WKSTS: WKIF Mask              */

#define LPI2C_WKSTS_WKAKDONE_Pos         (1)                                               /*!< LPI2C_T::WKSTS: WKAKDONE Position      */
#define LPI2C_WKSTS_WKAKDONE_Msk         (0x1ul << LPI2C_WKSTS_WKAKDONE_Pos)               /*!< LPI2C_T::WKSTS: WKAKDONE Mask          */

#define LPI2C_WKSTS_WRSTSWK_Pos          (2)                                               /*!< LPI2C_T::WKSTS: WRSTSWK Position       */
#define LPI2C_WKSTS_WRSTSWK_Msk          (0x1ul << LPI2C_WKSTS_WRSTSWK_Pos)                /*!< LPI2C_T::WKSTS: WRSTSWK Mask           */

