zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpi2c_reg.h
#define LPI2C_CTL1_TXPDMAEN_Pos          (0)                                               /*!< LPI2C_T::CTL1: TXPDMAEN Position       */
#define LPI2C_CTL1_TXPDMAEN_Msk          (0x1ul << LPI2C_CTL1_TXPDMAEN_Pos)                /*!< LPI2C_T::CTL1: TXPDMAEN Mask           */

#define LPI2C_CTL1_RXPDMAEN_Pos          (1)                                               /*!< LPI2C_T::CTL1: RXPDMAEN Position       */
#define LPI2C_CTL1_RXPDMAEN_Msk          (0x1ul << LPI2C_CTL1_RXPDMAEN_Pos)                /*!< LPI2C_T::CTL1: RXPDMAEN Mask           */

#define LPI2C_CTL1_PDMARST_Pos           (2)                                               /*!< LPI2C_T::CTL1: PDMARST Position        */
#define LPI2C_CTL1_PDMARST_Msk           (0x1ul << LPI2C_CTL1_PDMARST_Pos)                 /*!< LPI2C_T::CTL1: PDMARST Mask            */

#define LPI2C_CTL1_PDMASTR_Pos           (8)                                               /*!< LPI2C_T::CTL1: PDMASTR Position        */
#define LPI2C_CTL1_PDMASTR_Msk           (0x1ul << LPI2C_CTL1_PDMASTR_Pos)                 /*!< LPI2C_T::CTL1: PDMASTR Mask            */

#define LPI2C_CTL1_SWITCHEN_Pos          (10)                                              /*!< LPI2C_T::CTL1: SWITCHEN Position       */
#define LPI2C_CTL1_SWITCHEN_Msk          (0x1ul << LPI2C_CTL1_SWITCHEN_Pos)                /*!< LPI2C_T::CTL1: SWITCHEN Mask           */

#define LPI2C_STATUS1_ADMAT0_Pos         (0)                                               /*!< LPI2C_T::STATUS1: ADMAT0 Position      */
#define LPI2C_STATUS1_ADMAT0_Msk         (0x1ul << LPI2C_STATUS1_ADMAT0_Pos)               /*!< LPI2C_T::STATUS1: ADMAT0 Mask          */

#define LPI2C_STATUS1_ADMAT1_Pos         (1)                                               /*!< LPI2C_T::STATUS1: ADMAT1 Position      */
#define LPI2C_STATUS1_ADMAT1_Msk         (0x1ul << LPI2C_STATUS1_ADMAT1_Pos)               /*!< LPI2C_T::STATUS1: ADMAT1 Mask          */

#define LPI2C_STATUS1_ADMAT2_Pos         (2)                                               /*!< LPI2C_T::STATUS1: ADMAT2 Position      */
#define LPI2C_STATUS1_ADMAT2_Msk         (0x1ul << LPI2C_STATUS1_ADMAT2_Pos)               /*!< LPI2C_T::STATUS1: ADMAT2 Mask          */

#define LPI2C_STATUS1_ADMAT3_Pos         (3)                                               /*!< LPI2C_T::STATUS1: ADMAT3 Position      */
#define LPI2C_STATUS1_ADMAT3_Msk         (0x1ul << LPI2C_STATUS1_ADMAT3_Pos)               /*!< LPI2C_T::STATUS1: ADMAT3 Mask          */

#define LPI2C_STATUS1_ONBUSY_Pos         (8)                                               /*!< LPI2C_T::STATUS1: ONBUSY Position      */
#define LPI2C_STATUS1_ONBUSY_Msk         (0x1ul << LPI2C_STATUS1_ONBUSY_Pos)               /*!< LPI2C_T::STATUS1: ONBUSY Mask          */

#define LPI2C_TMCTL_STCTL_Pos            (0)                                               /*!< LPI2C_T::TMCTL: STCTL Position         */
#define LPI2C_TMCTL_STCTL_Msk            (0x1fful << LPI2C_TMCTL_STCTL_Pos)                /*!< LPI2C_T::TMCTL: STCTL Mask             */

#define LPI2C_TMCTL_HTCTL_Pos            (16)                                              /*!< LPI2C_T::TMCTL: HTCTL Position         */
#define LPI2C_TMCTL_HTCTL_Msk            (0x1fful << LPI2C_TMCTL_HTCTL_Pos)                /*!< LPI2C_T::TMCTL: HTCTL Mask             */

#define LPI2C_AUTOCTL_TGSRCSEL_Pos       (0)                                               /*!< LPI2C_T::AUTOCTL: TGSRCSEL Position    */
#define LPI2C_AUTOCTL_TGSRCSEL_Msk       (0xful << LPI2C_AUTOCTL_TGSRCSEL_Pos)             /*!< LPI2C_T::AUTOCTL: TGSRCSEL Mask        */

#define LPI2C_AUTOCTL_TRGEN_Pos          (4)                                               /*!< LPI2C_T::AUTOCTL: TRGEN Position       */
#define LPI2C_AUTOCTL_TRGEN_Msk          (0x1ul << LPI2C_AUTOCTL_TRGEN_Pos)                /*!< LPI2C_T::AUTOCTL: TRGEN Mask           */

#define LPI2C_AUTOCTL_TXWKEN_Pos         (5)                                               /*!< LPI2C_T::AUTOCTL: TXWKEN Position      */
#define LPI2C_AUTOCTL_TXWKEN_Msk         (0x1ul << LPI2C_AUTOCTL_TXWKEN_Pos)               /*!< LPI2C_T::AUTOCTL: TXWKEN Mask          */

#define LPI2C_AUTOCTL_RXWKEN_Pos         (6)                                               /*!< LPI2C_T::AUTOCTL: RXWKEN Position      */
#define LPI2C_AUTOCTL_RXWKEN_Msk         (0x1ul << LPI2C_AUTOCTL_RXWKEN_Pos)               /*!< LPI2C_T::AUTOCTL: RXWKEN Mask          */

#define LPI2C_AUTOCTL_NACKWKEN_Pos       (7)                                               /*!< LPI2C_T::AUTOCTL: NACKWKEN Position    */
#define LPI2C_AUTOCTL_NACKWKEN_Msk       (0x1ul << LPI2C_AUTOCTL_NACKWKEN_Pos)             /*!< LPI2C_T::AUTOCTL: NACKWKEN Mask        */

#define LPI2C_AUTOCTL_AUTOMODE_Pos       (8)                                               /*!< LPI2C_T::AUTOCTL: AUTOMODE Position    */
#define LPI2C_AUTOCTL_AUTOMODE_Msk       (0x7ul << LPI2C_AUTOCTL_AUTOMODE_Pos)             /*!< LPI2C_T::AUTOCTL: AUTOMODE Mask        */

#define LPI2C_AUTOCTL_SWTRG_Pos          (31)                                              /*!< LPI2C_T::AUTOCTL: SWTRG Position       */
#define LPI2C_AUTOCTL_SWTRG_Msk          (0x1ul << LPI2C_AUTOCTL_SWTRG_Pos)                /*!< LPI2C_T::AUTOCTL: SWTRG Mask           */

#define LPI2C_AUTOSTS_TXWKF_Pos          (0)                                               /*!< LPI2C_T::AUTOSTS: TXWKF Position       */
#define LPI2C_AUTOSTS_TXWKF_Msk          (0x1ul << LPI2C_AUTOSTS_TXWKF_Pos)                /*!< LPI2C_T::AUTOSTS: TXWKF Mask           */

#define LPI2C_AUTOSTS_RXWKF_Pos          (1)                                               /*!< LPI2C_T::AUTOSTS: RXWKF Position       */
#define LPI2C_AUTOSTS_RXWKF_Msk          (0x1ul << LPI2C_AUTOSTS_RXWKF_Pos)                /*!< LPI2C_T::AUTOSTS: RXWKF Mask           */

#define LPI2C_AUTOSTS_ERRORWKF_Pos       (2)                                               /*!< LPI2C_T::AUTOSTS: ERRORWKF Position    */
#define LPI2C_AUTOSTS_ERRORWKF_Msk       (0x1ul << LPI2C_AUTOSTS_ERRORWKF_Pos)             /*!< LPI2C_T::AUTOSTS: ERRORWKF Mask        */

#define LPI2C_AUTOSTS_TXFINISH_Pos       (8)                                               /*!< LPI2C_T::AUTOSTS: TXFINISH Position    */
#define LPI2C_AUTOSTS_TXFINISH_Msk       (0x1ul << LPI2C_AUTOSTS_TXFINISH_Pos)             /*!< LPI2C_T::AUTOSTS: TXFINISH Mask        */

#define LPI2C_AUTOSTS_RXFINISH_Pos       (9)                                               /*!< LPI2C_T::AUTOSTS: RXFINISH Position    */
#define LPI2C_AUTOSTS_RXFINISH_Msk       (0x1ul << LPI2C_AUTOSTS_RXFINISH_Pos)             /*!< LPI2C_T::AUTOSTS: RXFINISH Mask        */

