zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpi2c_reg.h
#define LPI2C_AUTOSTS_ERRORIF_Pos        (10)                                              /*!< LPI2C_T::AUTOSTS: ERRORIF Position     */
#define LPI2C_AUTOSTS_ERRORIF_Msk        (0x1ul << LPI2C_AUTOSTS_ERRORIF_Pos)              /*!< LPI2C_T::AUTOSTS: ERRORIF Mask         */

#define LPI2C_AUTOSTS_AOFINISH_Pos       (24)                                              /*!< LPI2C_T::AUTOSTS: AOFINISH Position    */
#define LPI2C_AUTOSTS_AOFINISH_Msk       (0x1ul << LPI2C_AUTOSTS_AOFINISH_Pos)             /*!< LPI2C_T::AUTOSTS: AOFINISH Mask        */

#define LPI2C_AUTOSTS_BUSY_Pos           (31)                                              /*!< LPI2C_T::AUTOSTS: BUSY Position        */
#define LPI2C_AUTOSTS_BUSY_Msk           (0x1ul << LPI2C_AUTOSTS_BUSY_Pos)                 /*!< LPI2C_T::AUTOSTS: BUSY Mask            */

#define LPI2C_AUTOCNT_TXCNT_Pos          (0)                                               /*!< LPI2C_T::AUTOCNT: TXCNT Position       */
#define LPI2C_AUTOCNT_TXCNT_Msk          (0xfful << LPI2C_AUTOCNT_TXCNT_Pos)               /*!< LPI2C_T::AUTOCNT: TXCNT Mask           */

#define LPI2C_AUTOCNT_RXCNT_Pos          (16)                                              /*!< LPI2C_T::AUTOCNT: RXCNT Position       */
#define LPI2C_AUTOCNT_RXCNT_Msk          (0xfful << LPI2C_AUTOCNT_RXCNT_Pos)               /*!< LPI2C_T::AUTOCNT: RXCNT Mask           */

/** @} LPI2C_CONST */
/** @} end of LPI2C register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __LPI2C_REG_H__ */
